In [11]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [12]:
df1 = pd.read_csv("Bengaluru_House_Data.csv")###reading the csv data into the varaible df1

In [13]:
df1.head()###displaying the data using head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [14]:
df1.shape###shows the number of rows and columns

(13320, 9)

In [15]:
df1.groupby(["area_type"])[['area_type']].agg('count')
###groupby area_type

                      area_type
area_type
Built-up  Area             2418
Carpet  Area                 87
Plot  Area                 2025
Super built-up  Area       8790

In [16]:
###we can give the functions like mean, median, etc to the agg function or a list of functions like 
###agg(['mean','median'])

In [21]:
##dropping the columns 
df2 = df1.drop(['area_type','society','balcony','availability'], axis='columns')
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [22]:
###dropping all the rows with null values in the columns
###1st display all the total null rows from all the total rows
df2.isnull().sum()
##this shows the number of rows in each column  with null values like location column has 1 null value

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [23]:
df3 = df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [24]:
df3.shape

(13246, 5)

TypeError: 'tuple' object is not callable

In [26]:
df3['size'].unique()
###first access the unique column, in this case 'size', and then access its unique values
###https://www.youtube.com/watch?v=Fylb3AQYxMIs 
##below shows all the unique values

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [27]:
####to convert this array into a list
list(df3['size'].unique())

['2 BHK',
 '4 Bedroom',
 '3 BHK',
 '4 BHK',
 '6 Bedroom',
 '3 Bedroom',
 '1 BHK',
 '1 RK',
 '1 Bedroom',
 '8 Bedroom',
 '2 Bedroom',
 '7 Bedroom',
 '5 BHK',
 '7 BHK',
 '6 BHK',
 '5 Bedroom',
 '11 BHK',
 '9 BHK',
 '9 Bedroom',
 '27 BHK',
 '10 Bedroom',
 '11 Bedroom',
 '10 BHK',
 '19 BHK',
 '16 BHK',
 '43 Bedroom',
 '14 BHK',
 '8 BHK',
 '12 Bedroom',
 '13 BHK',
 '18 Bedroom']

In [28]:
###total number of the unique values
len(df3['size'].unique())

31

In [29]:
###the  values in the size column is confusing and not clear and so to tackle that lets make a new column bhk since the 
###information in the size column is number of bedrooms
####create a new  column
###create a column based on the size column 
###for putting the values inside the column we use apply(), lambda x function
###the values are first kept inside the x using lambda x
###first split the vlaue of the column into two tokens done by x.split()
###take the 1st token ie.[0]
###till this time its all a sting, then convert in into integer 

df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

C:\Users\BJ\AppData\Local\Temp/ipykernel_15016/2314808787.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3['bhk'] = df3['size'].apply(lambda x: int(x.split(' ')[0]))

In [30]:
df3.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [31]:
df3['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [32]:
###bhk 43 is not normal
df3[df3.bhk>20]
###it doesnot look like 40 bedrooms can fit in 2400sqft

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [33]:
####total_sqft column clear chaina so we have to clean it because ranges haru dekhaira6 like  1133-1384
df3['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [34]:
#####here there is 1133-1384. this is a range. it has to converted into a single number.
###this has to be cleaned by using the average of these two numbers
###for it first detect the values are float or not

def is_float(x):
    try:
        float(x)###a value in the column is converted to float
    except:
        return False###if a value cat be converted to float then return false
    return True###otherwise true

In [35]:
df3[~df3['total_sqft'].apply(is_float)]
###returns the dataset which conissts of unconverted values
###~is for the values having range or not converted

                 location   size   total_sqft  bath    price  bhk
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800    2
...                   ...    ...          ...   ...      ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000    3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500    4

[190 rows x 6 columns]

In [36]:
df3[~df3['total_sqft'].apply(is_float)].head(10)

               location       size      total_sqft  bath    price  bhk
30            Yelahanka      4 BHK     2100 - 2850   4.0  186.000    4
122              Hebbal      4 BHK     3067 - 8156   4.0  477.000    4
137  8th Phase JP Nagar      2 BHK     1042 - 1105   2.0   54.005    2
165            Sarjapur      2 BHK     1145 - 1340   2.0   43.490    2
188            KR Puram      2 BHK     1015 - 1540   2.0   56.800    2
410             Kengeri      1 BHK  34.46Sq. Meter   1.0   18.500    1
549         Hennur Road      2 BHK     1195 - 1440   2.0   63.770    2
648             Arekere  9 Bedroom       4125Perch   9.0  265.000    9
661           Yelahanka      2 BHK     1120 - 1145   2.0   48.130    2
672        Bettahalsoor  4 Bedroom     3090 - 5002   4.0  445.000    4

In [37]:
###tackling the range values
def convert_sqft_to_num(x):
    tokens = x.split(' - ')
    if len(tokens) == 2:
        y = (float(tokens[0])+float(tokens[1]))/2
        return y
    try:
        return float(x)
    except:
        return None

In [38]:
###testing the fcuntion
print(convert_sqft_to_num('321 - 567'))
print(convert_sqft_to_num('678'))
print(convert_sqft_to_num('678 metre'))

444.0
678.0
None

In [39]:
df4 = df3.copy()###create a new dataset ds4 in which the total_sqft column will be different based on the function

In [40]:
df4['total_sqft'] = df4['total_sqft'].apply(convert_sqft_to_num)

In [41]:
df4.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [42]:
####for 30th location
df4.loc[30]

location      Yelahanka
size              4 BHK
total_sqft       2475.0
bath                4.0
price             186.0
bhk                   4
Name: 30, dtype: object

In [43]:
######just Checking
###30 ma total_sqft 2100-2850 cha
###yesko average is 2475 which we get using loc[30]i.e. loc is for location

In [50]:
#*********till now we have done data cleaning of the column total_sqft column,handling na, removed unnecessary features************************

In [51]:
#***********Now we do the feature engineering*******************************************************8

In [52]:
df4.head(3)

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3

In [53]:
df5 = df4.copy()

In [54]:
###now for the price total_sqft, which is very imporant in the real state prediction 
###we create a new column price_per_sq_ft in ds5

df5['price_per_sq_ft'] = df5['price']*100000/df5['total_sqft']

In [56]:
df5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sq_ft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000